{
  "filename": "CMAB 8150054_TM (1).pdf",
  "processed_at": "2025-11-22T00:28:45.141Z",
  "text": "#8150054\nWhat does the Real California Milk Seal mean?\nPage - 1\nThis sampling program is probably different from any other that you have been involved \nwith.  While today you are distributing samples of Joseph Farms Cheese, it is imperative \nthat you also communicate the benefits of products that carry the Real California Milk \nSeal. The benefits of products with the Real California Milk Seal include the following.  \n•The California Advisory Board is tasked with promoting dairy products made with 100% \nReal California Milk.  \n•The Real California Milk Seal can be found on dairy products like milk, butter, cheese, \nice cream, and more.  This unique round, yellow and black seal is a certified Mark of \nDistinction (similar to the USDA Organic Seal which includes regulatory oversight).  \nThere are thousands of products that have the RCM seal on their package today.\n•The RCM seal gives shoppers assurance that their dairy products are made with \nhigh-quality, nutritious dairy.  When shoppers buy RCM dairy products, they are \nsupporting multi-generational, family-owned businesses that are on the forefront of \nsustainable dairy farming practices. \nCalifornia Milk Advisory Board        \nJoseph Farms @ Food4Less - #8150054\n \n      \n\n#8150054\nPage - 2\nObjectives and Talking Points:\nYour Goals Today\n•To make shoppers aware of the Real California Milk seal and the variety of cheeses and other dairy \nproducts produced in California.\n•To encourage shoppers to use the Real California Milk coupons to purchase Joseph Farms Cheese \nproducts.\nTalking Points - Real California Milk Products  \n•California leads the nation in sustainable dairy farming.\n•Real California Milk products are made with 100% Real California Milk.\n•99% of California’s dairy farms are family owned and operated, most being multi-generational farmers.\nTalking Points – Joseph Farms Cheese Products  \n•What began as a small family farm has now grown into an internationally recognized brand, sold \nacross the United States, and around the world, including Europe, Latin America, Africa, and Asia. The \nJoseph Farms label symbolizes all natural, (No Artificial Hormones including rBST) world-class \nquality cheese, and is the trusted brand of choice for customers around the world.\n•Joseph Farms master cheese makers use generations of experience to slowly craft each cheese, \nensuring the uncompromised quality and delicious mouth-watering flavors that have earned \ncountless awards. Their cheese is then aged to perfection in a carefully controlled environment, which \ndevelops the unique flavor of each of our varieties.\n•Provides an excellent source of calcium. \n•Naturally gluten-free.\n\nWhat to Purchase:\nPage - 3\nProduct\nUPC\n# Units to \nBuy\nDistribution \nGoals\nJoseph Farms Mexican Blend, 32 oz.\n0-52833-12116-0\n2\n100\nJoseph Farms Cheddar Jack Shredded, 32 oz.\n0-52833-10321-0\n2\n100\nJoseph Farms Queso Quesadilla Shredded, 32 oz.\n0-52833-12118-0\n2\n100\nSmall Bag of Ice\nN/A\n1\nN/A\nSubstitute Item:  \nIf of any of the featured Joseph Farms cheeses are not available at the store, please substitute with \nmore of one of the featured varieties that are available.   \nDo not exceed $56.43 (including tax)\n#8150054\nCalifornia Milk Advisory Board        \nJoseph Farms @ Food4Less - #8150054\n \n      \n\n#8150054\nPage - 4\n• Demo Table\n• Black Tablecloth\n• Apron\n• Entire Kit Contents\n• Paperwork and Pen (to complete paperwork)\n• Cooler\n• Scissors\n• Allergy & Ingredient Sheet\n• Tape\n• Small Trash Can or Trash Bag\nWhat to Bring:\nWhat to Wear:\n•Black pants/skirt\n•Retailer approved uniform\n•Apron\n•Black, close-toed non-slip shoes \n(no open-toed shoes or gym shoes)\n•Face Mask \n•Agency approved hair restraint\n•200 Real California Milk BrandedNapkins\n•300 2-oz Souffle Cups\n•300 Spoons\n•3 Pairs of Gloves\n•1 Easel Card-Real California Milk Logo\n•1 EaselCard-The California Difference\n•100 Real California Milk Coupons\nKit Contents: please verify all are included\n\n#8150054\nPage - 5\nOn-Site Checklist:\n•Arrive on time to your store on the day of the event.  Introduce yourself to the store manager to briefly describe \nthe event.\n•Purchase the featured Joseph Farms Cheese products that you will be sampling today (Page 3).\n•Note the beginning inventory of the featured Joseph Farms cheese products and record it on your \nPromoReports form (if applicable). *DO NOT INCLUDE THE PRODUCT PURCHASED FOR SAMPLING.*   \n(At the end of the event, please remember to record the ending inventory of the featured products.)\n•Check to see if there is a secondary display of the products being sampled. If possible, set up your event table \nnear where the featured products are stocked.\n• Read and understand all of the information in this training manual.\n•  Review your kit contents for accuracy.\n• Conduct your pre-call to the store 3 days before your event and ask\n    the receiving clerk if the product is in stock.\nThe following Pre-Event Checklist must be completed prior to your event:\n\n#8150054\nTABLE BRANDING\nReal California Milk Coupon\nPage - 6\nReal California Milk\n Easel Card\nThe California Difference\nEasel Card\n\n#8150054\nArrive on time to your store on the day \nof your event. Upon arrival, introduce \nyourself to the store manager. \nWalk through the store to see if there is \na display of the featured Real \nCalifornia Milk products. Please try to \nset up as close to the sampled products \nas possible. If a Real California Milk \ndisplay is present, please try and set \nup near the display as a first priority.\nAs soon as you arrive at the store, \nplease purchase all of the products \nlisted on page 3 for sampling.\nBegin setting up your table with the \nBranded Napkins, Easel Cards, Real \nCalifornia Milk Coupons, and allergen \nsheet (last page of this Training \nManual).\nEvent Set Up Instructions:\nPage - 7\n\n#8150054\n•While wearing the gloves from your event kit, unwrap the package of Joseph Farms \nCheddar Jack Shredded, Joseph Farms Queso Quesadilla Shredded, and Joseph \nFarms Mexican Blend.\n•Using a spoon from your demo kit, fill souffle cups approximately 1/4 full with each of \nthe above products. (See Image A for the approximate amount of shreds to place in \nthe souffle cup). DO NOT combine the featured products into the same souffle \ncup.  Each variety should be placed in a separate souffle cup.\n•Place a spoon in each souffle cup before serving to shoppers for tasting.  (See \nImage B.) \n•Keep 3-4 samples of each product on your table available for shoppers to sample.  \n•Distribute samples to interested shoppers along with a money saving coupon, while \nreciting the features and benefits (page 2) of purchasing a product with the \nReal California Milk seal, as well as the featured Joseph Farms Cheese \nproducts.  \n•Keep all unused packages of Joseph Farms shredded cheeses not currently being \nused for sampling in the cooler to ensure they stay chilled.\n•Replenish samples as needed to accommodate store traffic.\n*** ENCOURAGE SHOPPERS TO TRY ALL JOSEPH FARMS CHEESE PRODUCTS \nAVAILABLE FOR SAMPLING. ***\nSampling Instructions:\nPage - 8\nImage A\nImage B\n\nNOTE: Please follow standard safety/health procedures when conducting your demo. Do not distribute samples to children. \nHand the sample to the parent or guardian to give to the child.\nALLERGY WARNING: We encourage consumers to check the ingredient statement on each package of the product they \nsample for the most up-to-date information on the ingredients contained in that product. \nYou must have your Allergen signs (from this Training Manual and/or in your kit) displayed on the front of the table during your \nsampling event.\nPlease recycle your consumer engagement materials when possible.\nPage - 9\n#8150054\nPost Event: \n•DO NOT take the sampled product out of the store.\n•Dispose of any leftover samples once your sampling event is complete.\n•Please leave any remaining coupons with the Store Manager.\n•Clean up, breakdown your table and leave your area as you found it.\n•Complete your PromoReports® Form and obtain a store stamp and a manager’s signature.\n•It is mandatory that you enter your results online to report your results upon event completion.  For online \nentry, please follow the instructions on your PromoReports® form. If you are purchasing product, do NOT \ninclude the product you are purchasing in your inventory count.\n•Retain your PromoReports® Form for 1 year after calling in your results.\n\nThis page has been intentionally left blank.\nPage - 10\n#8150054\n\nAllergen Information\nJoseph Farms Cheese\nWe encourage consumers to check the ingredient statement on each \npackage of the product they sample for the most up-to-date information \non the ingredients contained in the product.",
  "text_length": 8659,
  "parsed_data": {
    "demo_type": "Joseph Farms Cheese Demo",
    "products": {
      "featured": [
        {
          "name": "Joseph Farms Mexican Blend",
          "size": "32 oz.",
          "upc": "0-52833-12116-0"
        },
        {
          "name": "Joseph Farms Cheddar Jack Shredded",
          "size": "32 oz.",
          "upc": "0-52833-10321-0"
        },
        {
          "name": "Joseph Farms Queso Quesadilla Shredded",
          "size": "32 oz.",
          "upc": "0-52833-12118-0"
        }
      ]
    },
    "talking_points": {
      "real_california_milk": [
        "California leads the nation in sustainable dairy farming.",
        "Real California Milk products are made with 100% Real California Milk.",
        "99% of California's dairy farms are family owned and operated, most being multi-generational farmers."
      ],
      "joseph_farms_cheese": [
        "What began as a small family farm has now grown into an internationally recognized brand, sold across the United States, and around the world, including Europe, Latin America, Africa, and Asia. The Joseph Farms label symbolizes all natural, (No Artificial Hormones including rBST) world-class quality cheese, and is the trusted brand of choice for customers around the world.",
        "Joseph Farms master cheese makers use generations of experience to slowly craft each cheese, ensuring the uncompromised quality and delicious mouth-watering flavors that have earned countless awards. Their cheese is then aged to perfection in a carefully controlled environment, which develops the unique flavor of each of our varieties.",
        "Provides an excellent source of calcium.",
        "Naturally gluten-free."
      ]
    },
    "required_materials": {
      "bring_from_home": [
        "Demo Table",
        "Black Tablecloth",
        "Apron",
        "Paperwork and Pen (to complete paperwork)",
        "Cooler",
        "Scissors",
        "Allergy & Ingredient Sheet",
        "Tape",
        "Small Trash Can or Trash Bag",
        "200 Real California Milk Branded Napkins",
        "300 2-oz Souffle Cups",
        "300 Spoons",
        "3 Pairs of Gloves"
      ],
      "what_to_wear": [
        "Black pants/skirt",
        "Retailer approved uniform",
        "Apron",
        "Black, close-toed non-slip shoes (no open-toed shoes or gym shoes)",
        "Face Mask",
        "Agency approved hair restraint"
      ],
      "goal": "Distribution Goals: 100 units each of Joseph Farms Mexican Blend, Cheddar Jack Shredded, Queso Quesadilla Shredded. Do not exceed $56.43 (including tax)."
    }
  },
  "scheduled_events": [
    {
      "Job #": 8150054,
      "Project Name": "CMAB Joseph Farms @ Food 4 Less-11/21/2025",
      "Store Name": "Food 4 Less",
      "Store #": 29,
      "Store Address Line 1": "2323 W Hammer Lane",
      "Store City": "Stockton",
      "Store State": "CA",
      "Store Zip": 95209,
      "Project Date": "2025-11-29",
      "Project Time": "12 P - 4 P",
      "Demonstrator Name": "Diane Delgado"
    },
    {
      "Job #": 8150054,
      "Project Name": "CMAB Joseph Farms @ Food 4 Less-11/21/2025",
      "Store Name": "Food 4 Less",
      "Store #": 29,
      "Store Address Line 1": "2323 W Hammer Lane",
      "Store City": "Stockton",
      "Store State": "CA",
      "Store Zip": 95209,
      "Project Date": "2025-11-21",
      "Project Time": "12 P - 4 P",
      "Demonstrator Name": "Tina Borra"
    },
    {
      "Job #": 8150054,
      "Project Name": "CMAB Joseph Farms @ Food 4 Less-11/21/2025",
      "Store Name": "Food 4 Less",
      "Store #": 29,
      "Store Address Line 1": "2323 W Hammer Lane",
      "Store City": "Stockton",
      "Store State": "CA",
      "Store Zip": 95209,
      "Project Date": "2025-11-22",
      "Project Time": "12 P - 4 P",
      "Demonstrator Name": "Diane Delgado"
    },
    {
      "Job #": 8150054,
      "Project Name": "CMAB Joseph Farms @ Food 4 Less-11/21/2025",
      "Store Name": "Food 4 Less",
      "Store #": 29,
      "Store Address Line 1": "2323 W Hammer Lane",
      "Store City": "Stockton",
      "Store State": "CA",
      "Store Zip": 95209,
      "Project Date": "2025-11-28",
      "Project Time": "12 P - 4 P",
      "Demonstrator Name": "Cassandra Marshall"
    }
  ]
}